// Функция "main" в языке Dart

void main() {
/* "void" - определение функции, не возврощает никакого значения, просто выполняет определенные действия
    Функция "main" - входная точка в программу
    "()" - скобки означают, что функция не принемает параметров
    "{}" - блок функции, в которую помещается блок выполняемых инструкций
    Инструкции - основной строительный блок программы
    Каждая инструкция выполняет определенные действия:
    Вызов методов
    Объявление переменных и присвоения им значений
    И т.д
*/
}
