// Переменные в языке Dart

void main() {
  // Переменные в языке Dart, записываются следующим образом
  // Сначала указывается тип данных, затем имя переменной
  // Переменная предстовляет произвольное название, которое может состоять из букв и цифр, и символа нижнего подчеркивания
  int my_age = 70;
  print(my_age); // Вывод результата

  // Так-же можно использовать ключевое слово "var"
  // В этом случае, Dart сам выведит тип переменной, исходя из присвоенного значения
  var my_height = 180;
  print(my_height); // Вывод результата

  // В течении работы нашей программы, мы можем сколько угодно менять значение переменной
  my_height = 160;
  print(my_heigth);
}
